reports/load-testing-report.txt
Phase started: no_users (index: 0, duration: 10s) 16:17:32(-0500)

Phase completed: no_users (index: 0, duration: 10s) 16:17:42(-0500)

Phase started: constant_arrival (index: 1, duration: 60s) 16:17:42(-0500)

--------------------------------------
Metrics for period to: 16:17:50(-0500) (width: 6.861s)
--------------------------------------

http.codes.200: ................................................................ 70
http.codes.308: ................................................................ 70
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 140
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 287
  median: ...................................................................... 2
  p95: ......................................................................... 21.1
  p99: ......................................................................... 82.3
http.responses: ................................................................ 140
vusers.completed: .............................................................. 70
vusers.created: ................................................................ 70
vusers.created_by_name.movie-recommendation: ................................... 70
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 10.9
  max: ......................................................................... 398.7
  median: ...................................................................... 16.6
  p95: ......................................................................... 41.7
  p99: ......................................................................... 333.7


--------------------------------------
Metrics for period to: 16:18:00(-0500) (width: 9.865s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.308: ................................................................ 100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 12
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.movie-recommendation: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 10.2
  max: ......................................................................... 24.5
  median: ...................................................................... 12.1
  p95: ......................................................................... 16.9
  p99: ......................................................................... 21.1


--------------------------------------
Metrics for period to: 16:18:10(-0500) (width: 9.863s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.308: ................................................................ 100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 7
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.movie-recommendation: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.4
  max: ......................................................................... 21.5
  median: ...................................................................... 11.4
  p95: ......................................................................... 15
  p99: ......................................................................... 20.3


--------------------------------------
Metrics for period to: 16:18:20(-0500) (width: 9.87s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.308: ................................................................ 100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 11
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 6
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.movie-recommendation: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.4
  max: ......................................................................... 50.1
  median: ...................................................................... 11.4
  p95: ......................................................................... 15
  p99: ......................................................................... 16.9


--------------------------------------
Metrics for period to: 16:18:30(-0500) (width: 9.864s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.308: ................................................................ 100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 7
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.movie-recommendation: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.5
  max: ......................................................................... 20.1
  median: ...................................................................... 10.5
  p95: ......................................................................... 13.6
  p99: ......................................................................... 19.1


Phase completed: constant_arrival (index: 1, duration: 60s) 16:18:42(-0500)

Phase started: ramp_up (index: 2, duration: 60s) 16:18:42(-0500)

--------------------------------------
Metrics for period to: 16:18:40(-0500) (width: 9.863s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.308: ................................................................ 100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 7
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.movie-recommendation: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9
  max: ......................................................................... 33.6
  median: ...................................................................... 11.1
  p95: ......................................................................... 14.4
  p99: ......................................................................... 17.6


--------------------------------------
Metrics for period to: 16:18:50(-0500) (width: 9.996s)
--------------------------------------

http.codes.200: ................................................................ 119
http.codes.308: ................................................................ 120
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 240
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 7
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 5
http.responses: ................................................................ 239
vusers.completed: .............................................................. 119
vusers.created: ................................................................ 120
vusers.created_by_name.movie-recommendation: ................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.3
  max: ......................................................................... 26.5
  median: ...................................................................... 11.8
  p95: ......................................................................... 15
  p99: ......................................................................... 21.1


--------------------------------------
Metrics for period to: 16:19:00(-0500) (width: 9.94s)
--------------------------------------

http.codes.200: ................................................................ 192
http.codes.308: ................................................................ 191
http.request_rate: ............................................................. 39/sec
http.requests: ................................................................. 382
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 18
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7
http.responses: ................................................................ 383
vusers.completed: .............................................................. 192
vusers.created: ................................................................ 191
vusers.created_by_name.movie-recommendation: ................................... 191
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.1
  max: ......................................................................... 56.6
  median: ...................................................................... 11.4
  p95: ......................................................................... 16.3
  p99: ......................................................................... 25.8


--------------------------------------
Metrics for period to: 16:19:10(-0500) (width: 9.948s)
--------------------------------------

http.codes.200: ................................................................ 223
http.codes.308: ................................................................ 223
http.request_rate: ............................................................. 46/sec
http.requests: ................................................................. 450
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 189
  median: ...................................................................... 3
  p95: ......................................................................... 19.9
  p99: ......................................................................... 130.3
http.responses: ................................................................ 446
vusers.completed: .............................................................. 223
vusers.created: ................................................................ 227
vusers.created_by_name.movie-recommendation: ................................... 227
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.6
  max: ......................................................................... 197
  median: ...................................................................... 12.1
  p95: ......................................................................... 104.6
  p99: ......................................................................... 141.2


--------------------------------------
Metrics for period to: 16:19:20(-0500) (width: 9.99s)
--------------------------------------

http.codes.200: ................................................................ 245
http.codes.308: ................................................................ 245
http.request_rate: ............................................................. 55/sec
http.requests: ................................................................. 550
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1895
  median: ...................................................................... 7.9
  p95: ......................................................................... 1620
  p99: ......................................................................... 1863.5
http.responses: ................................................................ 490
vusers.completed: .............................................................. 245
vusers.created: ................................................................ 305
vusers.created_by_name.movie-recommendation: ................................... 305
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 12.9
  max: ......................................................................... 1902.6
  median: ...................................................................... 742.6
  p95: ......................................................................... 1826.6
  p99: ......................................................................... 1863.5


--------------------------------------
Metrics for period to: 16:19:30(-0500) (width: 9.972s)
--------------------------------------

http.codes.200: ................................................................ 245
http.codes.308: ................................................................ 245
http.request_rate: ............................................................. 64/sec
http.requests: ................................................................. 640
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5117
  median: ...................................................................... 8.9
  p95: ......................................................................... 4676.2
  p99: ......................................................................... 4965.3
http.responses: ................................................................ 490
vusers.completed: .............................................................. 245
vusers.created: ................................................................ 395
vusers.created_by_name.movie-recommendation: ................................... 395
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1811.7
  max: ......................................................................... 5125.2
  median: ...................................................................... 3328.3
  p95: ......................................................................... 4965.3
  p99: ......................................................................... 4965.3


Phase completed: ramp_up (index: 2, duration: 60s) 16:19:42(-0500)

Phase started: constant_arrival (index: 3, duration: 60s) 16:19:42(-0500)

--------------------------------------
Metrics for period to: 16:19:40(-0500) (width: 9.958s)
--------------------------------------

http.codes.200: ................................................................ 243
http.codes.308: ................................................................ 243
http.request_rate: ............................................................. 70/sec
http.requests: ................................................................. 689
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 9285
  median: ...................................................................... 122.7
  p95: ......................................................................... 8868.4
  p99: ......................................................................... 9230.4
http.responses: ................................................................ 486
vusers.completed: .............................................................. 243
vusers.created: ................................................................ 446
vusers.created_by_name.movie-recommendation: ................................... 446
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5141.7
  max: ......................................................................... 9293.9
  median: ...................................................................... 7407.5
  p95: ......................................................................... 9047.6
  p99: ......................................................................... 9230.4


--------------------------------------
Metrics for period to: 16:19:50(-0500) (width: 9.971s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 171
http.codes.200: ................................................................ 246
http.codes.308: ................................................................ 246
http.request_rate: ............................................................. 45/sec
http.requests: ................................................................. 454
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 10000
  median: ...................................................................... 12.1
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 492
vusers.completed: .............................................................. 246
vusers.created: ................................................................ 208
vusers.created_by_name.movie-recommendation: ................................... 208
vusers.failed: ................................................................. 171
vusers.session_length:
  min: ......................................................................... 9179.6
  max: ......................................................................... 10021.9
  median: ...................................................................... 9999.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 16:20:00(-0500) (width: 9.889s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 68
http.codes.200: ................................................................ 240
http.codes.308: ................................................................ 240
http.request_rate: ............................................................. 35/sec
http.requests: ................................................................. 340
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 9999
  median: ...................................................................... 10.1
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 480
vusers.completed: .............................................................. 240
vusers.created: ................................................................ 100
vusers.created_by_name.movie-recommendation: ................................... 100
vusers.failed: ................................................................. 68
vusers.session_length:
  min: ......................................................................... 12.6
  max: ......................................................................... 10027.5
  median: ...................................................................... 6976.1
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 16:20:10(-0500) (width: 9.861s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.308: ................................................................ 100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 8
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 5
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.movie-recommendation: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.1
  max: ......................................................................... 42.8
  median: ...................................................................... 11.1
  p95: ......................................................................... 16
  p99: ......................................................................... 19.1


--------------------------------------
Metrics for period to: 16:20:20(-0500) (width: 9.87s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.308: ................................................................ 100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.movie-recommendation: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6.5
  max: ......................................................................... 17.6
  median: ...................................................................... 11.1
  p95: ......................................................................... 14.7
  p99: ......................................................................... 16.9


--------------------------------------
Metrics for period to: 16:20:30(-0500) (width: 9.865s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.308: ................................................................ 100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 6
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 6
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.movie-recommendation: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8.9
  max: ......................................................................... 19.4
  median: ...................................................................... 10.7
  p95: ......................................................................... 16.6
  p99: ......................................................................... 18.7


Phase completed: constant_arrival (index: 3, duration: 60s) 16:20:42(-0500)

--------------------------------------
Metrics for period to: 16:20:40(-0500) (width: 9.866s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.308: ................................................................ 100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 7
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 6
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.movie-recommendation: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.2
  max: ......................................................................... 27
  median: ...................................................................... 10.5
  p95: ......................................................................... 16.3
  p99: ......................................................................... 17.6


All VUs finished. Total time: 3 minutes, 15 seconds

--------------------------------
Summary report @ 16:20:46(-0500)
--------------------------------

errors.ETIMEDOUT: .............................................................. 239
http.codes.200: ................................................................ 2753
http.codes.308: ................................................................ 2753
http.request_rate: ............................................................. 32/sec
http.requests: ................................................................. 5745
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 10000
  median: ...................................................................... 3
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 5506
vusers.completed: .............................................................. 2753
vusers.created: ................................................................ 2992
vusers.created_by_name.movie-recommendation: ................................... 2992
vusers.failed: ................................................................. 239
vusers.session_length:
  min: ......................................................................... 4.5
  max: ......................................................................... 10027.5
  median: ...................................................................... 15.3
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2